Revit 2027 API
TableSectionData.GetCustomFieldId Method
 Gets custom field id from the cell.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid GetCustomFieldId(
	int row,
	int col
)
Public Function GetCustomFieldId (
	row As Integer,
	col As Integer
) As Guid
public:
Guid GetCustomFieldId(
	int row,
	int col
)
member GetCustomFieldId :
        row : int *
        col : int -> Guid
Parameters
row Int32
 The row of the cell.
col Int32
 The column of the cell.
Return Value
Guid
 Returns custom field id from the cell. If this cell is not of type CellType.CustomField it will return an empty Guid
Exceptions
Exception | Condition
ArgumentException |  The given row number row is invalid. -or- The given column number col is invalid.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace